Tasks/БюджетнаяЗадача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Task>
		<Properties>
			<Name>БюджетнаяЗадача</Name>
			<Addressing>InformationRegister.ИсполнителиЗадач</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МодельБюджетирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапПодготовкиБюджетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДействийЭтаповПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаДействия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата и время фактического выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Comment>Плановый срок исполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Comment>Описание постановки задачи для исполнителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.БюджетнаяЗадача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИсходныйЭтапПодготовкиБюджетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор бизнес-процесса, который сформировал задачу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКонтрольныхОтчетов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапПодготовкиБюджетовОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцессПодготовкиБюджетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроцессПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УтверждаемыеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПланЗакупок</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланПродаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭкземплярБюджета</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланСборкиРазборки</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланПроизводства</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПодготовкиБюджетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыПодготовкиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПланЗакупок</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланПродаж</v8:Type>
								<v8:Type>cfg:DocumentRef.УстановкаЗначенийНефинансовыхПоказателей</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭкземплярБюджета</v8:Type>
								<v8:Type>cfg:DocumentRef.ЛимитыРасходаДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланСборкиРазборки</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/ОтправленныеОповещенияПоБюджетнымЗадачам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ОтправленныеОповещенияПоБюджетнымЗадачам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтправленногоОповещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОповещенийБюджетныхЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БюджетнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.БюджетнаяЗадача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОповещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОповещенийБюджетныхЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыДействийЭтаповПодготовкиБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыДействийЭтаповПодготовкиБюджетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводБюджетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводПлана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаЗначенийНефинансовыхПоказателей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтверждениеБюджетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторГруппыЭтапов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаЛимитовРасходаДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СтатусыПланов</Name>
			<Comment>Статусы планов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/МоделиБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>МоделиБюджетирования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыМоделейБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУтверждениеБюджетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БюджетыПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БюджетыПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВложениеКОповещениям</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиБюджетированияПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиФормироватьЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭтапыПодготовкиБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ЭтапыПодготовкиБюджетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.МоделиБюджетирования</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>130</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРасписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДействийЭтаповПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКонтрольныхОтчетов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаДействия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНастройкиДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСроковЭтаповПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДлительности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВыполненияЭтапов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокВыполненияЭтаповПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеЗапуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУсловийЗапускаЭтаповПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСроковЭтаповПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыполняется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Tasks/БюджетнаяЗадача/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.Дата = ТекущаяДатаСеанса();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЭтапыПодготовкиБюджетов") Тогда
		Реквизиты = Новый Структура();
		Реквизиты.Вставить("МодельБюджетирования", "Владелец");
		Реквизиты.Вставить("Действие", "Действие");
		Реквизиты.Вставить("Наименование", "Наименование");
		Реквизиты.Вставить("НастройкаДействия", "НастройкаДействия");
		Реквизиты.Вставить("НастройкиКонтрольныхОтчетов", "НастройкиКонтрольныхОтчетов");
		Реквизиты.Вставить("ОписаниеЗадачи", "ОписаниеЗадачи");
		Реквизиты.Вставить("ЭтапПодготовкиБюджетов", "Ссылка");
		Реквизиты.Вставить("Исполнитель", "Ответственный");
		Реквизиты.Вставить("Периодичность", "Родитель.Периодичность");
		ЗначениеРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, Реквизиты);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначениеРеквизитов);
		Задачи.БюджетнаяЗадача.УстановитьДлительностьЗадачи(ЭтотОбъект, ДанныеЗаполнения);
		Если Не ЗначениеЗаполнено(ЭтотОбъект.Период) Тогда
			ЭтотОбъект.Период =
				БюджетированиеКлиентСервер.ДатаНачалаПериода(ТекущаяДатаСеанса(), ЗначениеРеквизитов.Периодичность);
		КонецЕсли;
		ДополнительныеСвойства.Вставить("НастройкаДействия",
			ЗначениеРеквизитов.НастройкаДействия.Получить());
		ДополнительныеСвойства.Вставить("НастройкиКонтрольныхОтчетов",
			ЗначениеРеквизитов.НастройкиКонтрольныхОтчетов.Получить());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.МодельБюджетирования) 
		И (ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или Не ДанныеЗаполнения.Свойство("МодельБюджетирования")) Тогда
		ЭтотОбъект.МодельБюджетирования = Справочники.МоделиБюджетирования.МодельБюджетированияПоУмолчанию();
	КонецЕсли;
	
	ТаблицаУтверждаемыхДокументов =
		Задачи.БюджетнаяЗадача.УтверждаемыеДокументыПоШагуПроцесса(Действие, НастройкаДействия.Получить(), Период);
		
	УтверждаемыеДокументы.Загрузить(ТаблицаУтверждаемыхДокументов);
	
	Автор = ПользователиКлиентСервер.АвторизованныйПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Перем Ошибки;
	
	Если КонецДня(СрокИсполнения) < Дата Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
			Ошибки, "Объект.СрокИсполнения", НСтр("ru = 'Срок не может быть меньше даты назначения!'"), "");
	КонецЕсли;
	
	ЭтапПроверки = ?(ЗначениеЗаполнено(ЭтапПодготовкиБюджетовОснование), ЭтапПодготовкиБюджетовОснование, ЭтапПодготовкиБюджетов);
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтапПроверки, "ВыполнятьАвтоматически") = Ложь Тогда
		ПроверяемыеРеквизиты.Добавить("Исполнитель");
	КонецЕсли;
	
	Если Выполнена Тогда
		
		Если ЗначениеЗаполнено(ДатаИсполнения) И ДатаИсполнения < Дата Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
				Ошибки, "Объект.ДатаИсполнения", НСтр("ru = 'Дата исполнения не может быть меньше даты назначения!'"), "");
		КонецЕсли;
		
		ПараметрыОпции = Новый Структура("МодельБюджетирования", МодельБюджетирования);
		ИспользоватьУтверждениеБюджетов = ПолучитьФункциональнуюОпцию("ИспользоватьУтверждениеБюджетов", ПараметрыОпции); 
		
		ЭтоСвязаннаяЗадача = ЗначениеЗаполнено(ОсновнаяЗадача);
		УстановитьПривилегированныйРежим(Истина);
		ОсновнаяЗадачаДействие = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнаяЗадача, "Действие");
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ИспользоватьУтверждениеБюджетов И (Не ЭтоСвязаннаяЗадача 
			ИЛИ ОсновнаяЗадачаДействие = Перечисления.ТипыДействийЭтаповПодготовкиБюджетов.УтверждениеБюджетов) Тогда
			
			Если СписокДокументов.Количество()
				И (Действие = Перечисления.ТипыДействийЭтаповПодготовкиБюджетов.ВводПлана
					ИЛИ Действие = Перечисления.ТипыДействийЭтаповПодготовкиБюджетов.ВводБюджетов) Тогда
				МассивДокументов = СписокДокументов.ВыгрузитьКолонку("Документ");
				РеквизитыДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивДокументов, "Статус, Проведен");
				Для Каждого РеквизитыДокумента Из РеквизитыДокументов Цикл
					Если РеквизитыДокумента.Значение.Статус = Перечисления.СтатусыПланов.ВПодготовке
						ИЛИ Не РеквизитыДокумента.Значение.Проведен Тогда
						ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
							Ошибки, "",
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Для выполнения задачи документ %1 должен быть проведен в статусе ""На утверждении""'"),
								РеквизитыДокумента.Ключ), "");
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли Действие = Перечисления.ТипыДействийЭтаповПодготовкиБюджетов.УтверждениеБюджетов Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	УтверждаемыеДокументы.НомерСтроки,
				|	УтверждаемыеДокументы.Документ,
				|	УтверждаемыеДокументы.ЭтапПодготовкиБюджетов
				|ПОМЕСТИТЬ УтверждаемыеДокументы
				|ИЗ
				|	&УтверждаемыеДокументы КАК УтверждаемыеДокументы
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	УтверждаемыеДокументы.НомерСтроки КАК НомерСтроки,
				|	УтверждаемыеДокументы.Документ,
				|	ВЫБОР
				|		КОГДА НЕ ЭкземплярБюджета.Ссылка ЕСТЬ NULL 
				|			ТОГДА ЭкземплярБюджета.Статус
				|		КОГДА НЕ ПланЗакупок.Ссылка ЕСТЬ NULL 
				|			ТОГДА ПланЗакупок.Статус
				|		КОГДА НЕ ПланПродаж.Ссылка ЕСТЬ NULL 
				|			ТОГДА ПланПродаж.Статус
				|		КОГДА НЕ ПланПроизводства.Ссылка ЕСТЬ NULL 
				|			ТОГДА ПланПроизводства.Статус
				|		КОГДА НЕ ПланСборкиРазборки.Ссылка ЕСТЬ NULL 
				|			ТОГДА ПланСборкиРазборки.Статус
				|	КОНЕЦ КАК Статус,
				|	ВЫБОР
				|		КОГДА НЕ ЭкземплярБюджета.Ссылка ЕСТЬ NULL 
				|			ТОГДА ЭкземплярБюджета.Проведен
				|		КОГДА НЕ ПланЗакупок.Ссылка ЕСТЬ NULL 
				|			ТОГДА ПланЗакупок.Проведен
				|		КОГДА НЕ ПланПродаж.Ссылка ЕСТЬ NULL 
				|			ТОГДА ПланПродаж.Проведен
				|		КОГДА НЕ ПланПроизводства.Ссылка ЕСТЬ NULL 
				|			ТОГДА ПланПроизводства.Проведен
				|		КОГДА НЕ ПланСборкиРазборки.Ссылка ЕСТЬ NULL 
				|			ТОГДА ПланСборкиРазборки.Проведен
				|	КОНЕЦ КАК Проведен
				|ИЗ
				|	УтверждаемыеДокументы КАК УтверждаемыеДокументы
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПодготовкиБюджетов КАК ЭтапыПодготовкиБюджетов
				|		ПО УтверждаемыеДокументы.ЭтапПодготовкиБюджетов = ЭтапыПодготовкиБюджетов.Ссылка
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭкземплярБюджета КАК ЭкземплярБюджета
				|		ПО УтверждаемыеДокументы.Документ = ЭкземплярБюджета.Ссылка
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПланЗакупок КАК ПланЗакупок
				|		ПО УтверждаемыеДокументы.Документ = ПланЗакупок.Ссылка
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПланПродаж КАК ПланПродаж
				|		ПО УтверждаемыеДокументы.Документ = ПланПродаж.Ссылка
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПланПроизводства КАК ПланПроизводства
				|		ПО УтверждаемыеДокументы.Документ = ПланПроизводства.Ссылка
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПланСборкиРазборки КАК ПланСборкиРазборки
				|		ПО УтверждаемыеДокументы.Документ = ПланСборкиРазборки.Ссылка
				|ГДЕ
				|	(НЕ ВЫБОР
				|					КОГДА НЕ ЭкземплярБюджета.Ссылка ЕСТЬ NULL 
				|						ТОГДА ЭкземплярБюджета.Статус
				|					КОГДА НЕ ПланЗакупок.Ссылка ЕСТЬ NULL 
				|						ТОГДА ПланЗакупок.Статус
				|					КОГДА НЕ ПланПродаж.Ссылка ЕСТЬ NULL 
				|						ТОГДА ПланПродаж.Статус
				|					КОГДА НЕ ПланПроизводства.Ссылка ЕСТЬ NULL 
				|						ТОГДА ПланПроизводства.Статус
				|					КОГДА НЕ ПланСборкиРазборки.Ссылка ЕСТЬ NULL 
				|						ТОГДА ПланСборкиРазборки.Статус
				|				КОНЕЦ В (ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Утвержден), ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Отменен))
				|			ИЛИ ВЫБОР
				|				КОГДА НЕ ЭкземплярБюджета.Ссылка ЕСТЬ NULL 
				|					ТОГДА ЭкземплярБюджета.Проведен
				|				КОГДА НЕ ПланЗакупок.Ссылка ЕСТЬ NULL 
				|					ТОГДА ПланЗакупок.Проведен
				|				КОГДА НЕ ПланПродаж.Ссылка ЕСТЬ NULL 
				|					ТОГДА ПланПродаж.Проведен
				|				КОГДА НЕ ПланПроизводства.Ссылка ЕСТЬ NULL 
				|					ТОГДА ПланПроизводства.Проведен
				|				КОГДА НЕ ПланСборкиРазборки.Ссылка ЕСТЬ NULL 
				|					ТОГДА ПланСборкиРазборки.Проведен
				|			КОНЕЦ = ЛОЖЬ)
				|
				|УПОРЯДОЧИТЬ ПО
				|	НомерСтроки";
				Запрос.УстановитьПараметр("УтверждаемыеДокументы", УтверждаемыеДокументы.Выгрузить());
				Запрос.УстановитьПараметр("СтатусУтвержден", Перечисления.СтатусыПланов.Утвержден);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Для выполнения задачи необходимо документ %1 провести в статусах ""Утвержден"" или ""Отклонен""'"),
						Выборка.Документ);
						
					ПолеОшибки = "Объект." 
						+ ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
						"УтверждаемыеДокументы", Выборка.НомерСтроки, "Документ");
					
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПолеОшибки, ТекстСообщения, "");
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаИсполнения) И Выполнена Тогда
		ДатаИсполнения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОповещенияДляЗадачБюджетирования")
		И Ссылка.Пустая() Тогда
		ДополнительныеСвойства.Вставить("СоздатьОповещениеНаПоступлениеЗадачи", Истина);
	КонецЕсли;
	
	РедактированиеБюджетныхЗадачВнеПроцессов = РольДоступна("РедактированиеБюджетныхЗадачВнеПроцессов")
		ИЛИ Пользователи.ЭтоПолноправныйПользователь(, , Истина);
	
	Если Не РедактированиеБюджетныхЗадачВнеПроцессов Тогда
		ТекстОшибки = "";
		Если Не ЗначениеЗаполнено(ОсновнаяЗадача) И (Не ЗначениеЗаполнено(Ссылка) ИЛИ Исполнитель <> Пользователи.ТекущийПользователь()  
			ИЛИ Исполнитель <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Исполнитель") ) Тогда
			ТекстОшибки = НСтр("ru='В рамках бюджетного процесса разрешено создавать/изменять только связанные задачи.'");
		ИначеЕсли ЗначениеЗаполнено(ОсновнаяЗадача) И Действие = Перечисления.ТипыДействийЭтаповПодготовкиБюджетов.ВводБюджетов 
			И (Не ЗначениеЗаполнено(Ссылка) ИЛИ Исполнитель <> Пользователи.ТекущийПользователь()  
				ИЛИ Исполнитель <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Исполнитель") ) Тогда
			ТекстОшибки = НСтр("ru='В рамках бюджетного процесса запрещено создавать/изменять задачи на ввод бюджета.'");
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ДополнительныеСвойства.Свойство("РежимФормированияЗадач") Тогда
		Если Выполнена и Не ПометкаУдаления Тогда
			Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
				Задачи.БюджетнаяЗадача.ФормированиеБюджетныхЗадач(МодельБюджетирования,ПроцессПодготовкиБюджетов);
			Иначе
				ПараметрыЗадания = Новый Массив();
				ПараметрыЗадания.Добавить(МодельБюджетирования);
				ПараметрыЗадания.Добавить(ПроцессПодготовкиБюджетов);
				ФоновыеЗадания.Выполнить("БюджетированиеСервер.ФормированиеБюджетныхЗадач",ПараметрыЗадания);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("СоздатьОповещениеНаПоступлениеЗадачи") Тогда
		ФоновыеЗадания.Выполнить(Метаданные.РегламентныеЗадания.ФормированиеОповещенийПоБюджетнымЗадачам.ИмяМетода);
	ИначеЕсли Выполнена ИЛИ ПометкаУдаления Тогда
		НаборЗаписей = РегистрыСведений.ОтправленныеОповещенияПоБюджетнымЗадачам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.БюджетнаяЗадача.Установить(Ссылка);
		НаборЗаписей.Записать();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
